app/views/tracks/_form.html.erb

SELECT "albums".* FROM "albums"
---
    <select name="track[album_id]" id="album">
    <% Album.all.each do |album| %>