app/views/tracks/new.html.erb

    <select name="track[album_id]" id="album">
    <% Album.all.each do |album| %>
---
SELECT "albums".* FROM "albums"