app/views/albums/edit.html.erb

    <select name="album[band_id]" id="band">
        <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"