app/views/albums/new.html.erb

SELECT "bands".* FROM "bands"
---
    <select name="album[band_id]" id="band">
        <% Band.all.each do |band| %>