app/views/albums/show.html.erb

<ul>
    <% @album.tracks.each do |track|%>
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 24]]