app/controllers/albums_controller.rb

    def new
        @band = Band.find_by(id: params[:band_id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def create
        @album = Album.new(album_params)

        if @album.save
---
INSERT INTO "albums" ("band_id", "year", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["band_id", 9], ["year", "2000"], ["created_at", "2020-06-27 18:02:43.376411"], ["updated_at", "2020-06-27 18:02:43.376411"], ["name", "Songs"]]

    def update
        @album = Album.find_by(id: params[:id])

        if @album.update_attributes(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "albums" SET "live" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["live", true], ["updated_at", "2020-06-27 18:02:47.325862"], ["id", 23]]

    def destroy
        @album = Album.find_by(id: params[:id])

        if @album
            @album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 20]]