app/controllers/application_controller.rb

    def current_user
        @user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "6ugl5gJDNRmyIihFLog9QA"], ["LIMIT", 1]]