app/controllers/notes_controller.rb

    def create
        @note = Note.new(note_params)
        @note.user = current_user

        if @note.save
---
INSERT INTO "notes" ("content", "user_id", "track_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "It's a great song."], ["user_id", 4], ["track_id", 4], ["created_at", "2020-06-28 20:34:15.085868"], ["updated_at", "2020-06-28 20:34:15.085868"]]

    def destroy
        @note = current_user.notes.find_by(id: params[:id])
        @note.destroy
---
SELECT  "notes".* FROM "notes" WHERE "notes"."user_id" = $1 AND "notes"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 1]]