app/controllers/tracks_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
    def new
        @album = Album.find_by(id: params[:album_id])

INSERT INTO "tracks" ("album_id", "ord", "created_at", "updated_at", "name", "lyrics") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["album_id", 24], ["ord", 1], ["created_at", "2020-06-28 19:41:30.411167"], ["updated_at", "2020-06-28 19:41:30.411167"], ["name", "Somebody out there"], ["lyrics", "lalallallaa"]]
---
    def create
        @track = Track.new(track_params)

        if @track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def show
        @track = Track.find_by(id: params[:id])

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @track = Track.find_by(id: params[:id])

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tracks" SET "name" = $1, "bonus" = $2, "updated_at" = $3 WHERE "tracks"."id" = $4  [["name", "Somebody"], ["bonus", true], ["updated_at", "2020-06-28 20:00:48.238731"], ["id", 1]]
---
    def update
        @track = Track.find_by(id: params[:id])

        if @track.update_attributes(track_params)

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 1]]
---
    def destroy
        @track = Track.find_by(id: params[:id])

        if @track
            @track.destroy