app/controllers/users_controller.rb

    def create
        user = User.new(user_params)

        if user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at", "activation_token", "email") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def activate
        @user = User.find_by(activation_token: params[:activation_token])
---
SELECT  "users".* FROM "users" WHERE "users"."activation_token" = $1 LIMIT $2  [["activation_token", "VO3zICuMGU9zAplt1rAq_g"], ["LIMIT", 1]]