app/models/user.rb

UPDATE "users" SET "activated" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["activated", true], ["updated_at", "2020-06-28 21:46:14.433340"], ["id", 6]]
---
    def activate!
        self.activated = true
        self.save